Revit 2026 API

# Water Class

---

A static class that provides access to the property names that appear in the Water visual asset schema.

SystemObject Autodesk.Revit.DB.VisualWater

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Water
```
```vb
Public NotInheritable Class Water
```
```cpp
public ref class Water abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Water = class end
```

The Water type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "Water" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "Water" schema. |
|  | WaterBumpAmount | The property labeled "Wave Height" from the "Water" schema. |
|  | WaterColorByObject | The property labeled "Custom Color" from the "Water" schema. |
|  | WaterTintColor | The property labeled "Custom Color" from the "Water" schema. |
|  | WaterTintEnable | The property labeled "Color" from the "Water" schema. |
|  | WaterType | The property labeled "Type" from the "Water" schema. |

#### Reference

Autodesk.Revit.DB.Visual Namespace